app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices" WHERE "devices"."serial_number" = ? LIMIT ?  [["serial_number", "123456"], ["LIMIT", 1]]
---
  def assign
    serial_number = params[:serial_number] || params.dig(:device, :serial_number)
    device = Device.find_by(serial_number: serial_number)

SELECT "devices".* FROM "devices" WHERE "devices"."serial_number" = ? LIMIT ?  [["serial_number", "123456"], ["LIMIT", 1]]
---
  def unassign
    device = Device.find_by(serial_number: params[:serial_number])